app/controllers/visits_controller.rb

  def index
    @visits = Visit.all
---
SELECT "visits".* FROM "visits"

  def create
    @visit = Visit.new(visit_params)

    if @visit.save
---
INSERT INTO "visits" ("date", "completed", "food_pantry", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date", "2020-07-12"], ["completed", 0], ["food_pantry", "Salvation Army"], ["created_at", "2020-07-12 21:39:34.792459"], ["updated_at", "2020-07-12 21:39:34.792459"]]

  def update
    if @visit.update(visit_params)
---
UPDATE "visits" SET "date" = ?, "completed" = ?, "updated_at" = ? WHERE "visits"."id" = ?  [["date", "2020-07-02"], ["completed", 0], ["updated_at", "2020-07-17 16:14:37.331447"], ["id", 1]]

  def destroy
    @visit.destroy
---
DELETE FROM "visits" WHERE "visits"."id" = ?  [["id", 29]]

    def set_visit
      @visit = Visit.find(params[:id])
---
SELECT "visits".* FROM "visits" WHERE "visits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]