foodshare-backend/app/controllers/items_controller.rb

INSERT INTO "items" ("name", "quantity", "visit_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Cabbage (head)"], ["quantity", 4], ["visit_id", 71], ["created_at", "2020-07-17 01:21:24.235224"], ["updated_at", "2020-07-17 01:21:24.235224"]]
---
  def create
    @item = Item.new(item_params)

    if @item.save